# Categories of Joins

In [1]:
import numpy as np
import pandas as pd

In [2]:
df1 = pd.DataFrame({'employee': ['Duc','Mai','Lan','Cuong'],
                    'group': ['Accounting','Engineering','Engineering','HR']})

df2 = pd.DataFrame({'employee': ['Mai','Lan','Duc','Cuong'],
                    'hire_date': [2004, 2008, 2012, 2013]})

print(df1); print(df2)

  employee        group
0      Duc   Accounting
1      Mai  Engineering
2      Lan  Engineering
3    Cuong           HR
  employee  hire_date
0      Mai       2004
1      Lan       2008
2      Duc       2012
3    Cuong       2013

In [3]:
df3 = pd.merge(df1, df2)

In [4]:
df3

  employee        group  hire_date
0      Duc   Accounting       2012
1      Mai  Engineering       2004
2      Lan  Engineering       2008
3    Cuong           HR       2013

In [7]:
df4 = pd.DataFrame({'group': ['Accounting','Engineering','HR'],
                    'supervisor': ['Dung','Huy','Minh']})
print(df3); print(df4); print(pd.merge(df3,df4))

  employee        group  hire_date
0      Duc   Accounting       2012
1      Mai  Engineering       2004
2      Lan  Engineering       2008
3    Cuong           HR       2013
         group supervisor
0   Accounting       Dung
1  Engineering        Huy
2           HR       Minh
  employee        group  hire_date supervisor
0      Duc   Accounting       2012       Dung
1      Mai  Engineering       2004        Huy
2      Lan  Engineering       2008        Huy
3    Cuong           HR       2013       Minh

In [9]:
# Many to Many Joins
df5 = pd.DataFrame({'group':['Accounting','Accounting',
                             'Engineering','Engineering',
                             'HR','HR'],
                    'skills':['math', 'spreadsheets','coding','linux',
                              'spreasheets', 'organizations']})
print(df1); print(df5); print(pd.merge(df1,df5))

  employee        group
0      Duc   Accounting
1      Mai  Engineering
2      Lan  Engineering
3    Cuong           HR
         group         skills
0   Accounting           math
1   Accounting   spreadsheets
2  Engineering         coding
3  Engineering          linux
4           HR    spreasheets
5           HR  organizations
  employee        group         skills
0      Duc   Accounting           math
1      Duc   Accounting   spreadsheets
2      Mai  Engineering         coding
3      Mai  Engineering          linux
4      Lan  Engineering         coding
5      Lan  Engineering          linux
6    Cuong           HR    spreasheets
7    Cuong           HR  organizations

# Specification of the Merge Key

In [10]:
print(df1); print(df2); print(pd.merge(df1, df2, on='employee'))

  employee        group
0      Duc   Accounting
1      Mai  Engineering
2      Lan  Engineering
3    Cuong           HR
  employee  hire_date
0      Mai       2004
1      Lan       2008
2      Duc       2012
3    Cuong       2013
  employee        group  hire_date
0      Duc   Accounting       2012
1      Mai  Engineering       2004
2      Lan  Engineering       2008
3    Cuong           HR       2013

In [11]:
df3 = pd.DataFrame({'name': ['Duc', 'Mai','Lan','Cuong'],
                    'salary': [70000,80000,120000,100000]})
print(df1); print(df3);
print(pd.merge(df1, df3,left_on='employee', right_on='name'))

  employee        group
0      Duc   Accounting
1      Mai  Engineering
2      Lan  Engineering
3    Cuong           HR
    name  salary
0    Duc   70000
1    Mai   80000
2    Lan  120000
3  Cuong  100000
  employee        group   name  salary
0      Duc   Accounting    Duc   70000
1      Mai  Engineering    Mai   80000
2      Lan  Engineering    Lan  120000
3    Cuong           HR  Cuong  100000

In [13]:
pd.merge(df1, df3,left_on='employee', right_on='name').drop('name', axis=1)

  employee        group  salary
0      Duc   Accounting   70000
1      Mai  Engineering   80000
2      Lan  Engineering  120000
3    Cuong           HR  100000

In [14]:
df1a = df1.set_index('employee')
df2a = df2.set_index('employee')
print(df1a); print(df2a)

                group
employee
Duc        Accounting
Mai       Engineering
Lan       Engineering
Cuong              HR
          hire_date
employee
Mai            2004
Lan            2008
Duc            2012
Cuong          2013

In [15]:
print(pd.merge(df1a,df2a, left_index=True, right_index=True))

                group  hire_date
employee
Duc        Accounting       2012
Mai       Engineering       2004
Lan       Engineering       2008
Cuong              HR       2013

In [16]:
print(df1a); print(df2a); print(df1a.join(df2a))

                group
employee
Duc        Accounting
Mai       Engineering
Lan       Engineering
Cuong              HR
          hire_date
employee
Mai            2004
Lan            2008
Duc            2012
Cuong          2013
                group  hire_date
employee
Duc        Accounting       2012
Mai       Engineering       2004
Lan       Engineering       2008
Cuong              HR       2013

In [17]:
print(df1a); print(df3)
print(pd.merge(df1a, df3, left_index=True, right_on='name'))

                group
employee
Duc        Accounting
Mai       Engineering
Lan       Engineering
Cuong              HR
    name  salary
0    Duc   70000
1    Mai   80000
2    Lan  120000
3  Cuong  100000
         group   name  salary
0   Accounting    Duc   70000
1  Engineering    Mai   80000
2  Engineering    Lan  120000
3           HR  Cuong  100000

# Specifying Set Arithmetic for Joins

In [20]:
df6 = pd.DataFrame({'name':['Duc','Cuong','Hieu'],
                    'food': ['fish','beans','bread']},
                  columns=['name','food'])
df7 = pd.DataFrame({'name':['Hieu','Huy'],
                    'drink': ['wine','beer']},
                  columns=['name','drink'])
print(df6); print(df7); 
print(pd.merge(df6,df7))

    name   food
0    Duc   fish
1  Cuong  beans
2   Hieu  bread
   name drink
0  Hieu  wine
1   Huy  beer
   name   food drink
0  Hieu  bread  wine

In [21]:
pd.merge(df6, df7, how='inner')

   name   food drink
0  Hieu  bread  wine

In [22]:
pd.merge(df6, df7, how='outer')

    name   food drink
0    Duc   fish   NaN
1  Cuong  beans   NaN
2   Hieu  bread  wine
3    Huy    NaN  beer

In [23]:
pd.merge(df6, df7, how='left')

    name   food drink
0    Duc   fish   NaN
1  Cuong  beans   NaN
2   Hieu  bread  wine

# Overlapping Column Names

In [24]:
df1 = pd.DataFrame({'name':['Duc','Cuong','Hieu','Manh'],
                    'rank': [1,2,3,4]})
df2 = pd.DataFrame({'name':['Duc','Cuong','Hieu','Manh'],
                    'rank': [1,3,2,4]})
print(df1); print(df1);
print(pd.merge(df1,df2, on = 'name'))

    name  rank
0    Duc     1
1  Cuong     2
2   Hieu     3
3   Manh     4
    name  rank
0    Duc     1
1  Cuong     2
2   Hieu     3
3   Manh     4
    name  rank_x  rank_y
0    Duc       1       1
1  Cuong       2       3
2   Hieu       3       2
3   Manh       4       4

In [25]:
print(pd.merge(df1,df2, on='name', suffixes=["_M","_N"]))

    name  rank_M  rank_N
0    Duc       1       1
1  Cuong       2       3
2   Hieu       3       2
3   Manh       4       4